#   THEO - THON

from userbot.Config import Config # Ok - 🖤 

USERID = Config.OWNER_ID
Name = Config.ALIVE_NAME
DEFAULTUSER = str(Name) if Name else "THEO THON"
mention = f"[{Name}](tg://user?id={USERID})"

Plugin = "userbot/plugins/{}.py"
Admin = "userbot/plugins/Admin/{}.py"
Animation = "userbot/plugins/animations/{}.py"
Tosh = "userbot/plugins/tosha/{}.py"
Assistant = "userbot/plugins/assistant/{}.py"
AssistantPm = "userbot/plugins/assistant/PmTosh/{}.py"

Xtbot = "\"TG_BOT_TOKEN\""
Xt = "TG_BOT_TOKEN"
Xe = "STRING_SESSION"

A = Config.APP_ID
H = Config.API_HASH
B = Config.TG_BOT_TOKEN
N = Config.NO_LOAD

Start = (
    """
    <------------------------------------>
         يتم تحميل ملفات السورس ثـيـو 
    <------------------------------------>
    """
)

TOSHA = Config.PRIVATE_GROUP_BOT_API_ID
TBOT = Config.TG_BOT_USERNAME
T = Config.COMMAND_HAND_LER or "."
DEVL = "@ZEDthon"

C = "**⌔╎المعادله ⪼** {}\n  **- الحل ⪼** {}"
Calc = (
    "𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 𝗧𝗵𝗲𝗼 - 𝑪𝑨𝑳𝑪𝑼𝑳𝑨𝑻𝑶𝑹 𓆪\n"
    "◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n"
    "**⌔╎قائـمه اوامر الحاسبه :** \n"
    "⪼ `.حاسبه` + المعادله \n"
    "◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n"
    "𓆩 𝗦𝗢𝗨𝗥𝗖𝗘 𝙏𝙝𝙚𝙤 - [𝘿𝙀𝙑](t.me/Source_Theo ) 𓆪"
)

kk = [
   "╭━━━╮\n┃╭━━╯\n┃╰━━╮\n┃╭━━╯\n┃┃\n╰╯",
   "┏━━━┓\n┃┏━━┛\n┃┗━━┓\n┃┏━━┛\n┃┃\n┗┛"
]

urs = "**⌔╎نسبة نجاحك هيه -** {}"
Fl = [
   "+100% 🔱🖤", "100% 🖤", "95%", "90%","85%", "80%", "75%", "70%", "65%", "60%", "55%", 
   "50%", "45%", "40%", "35%", "30%", "25%", "20%", "15%", "10%", "0%", "-0%"
]

MSGE = (
   f"𓆰 𝗦𝗢𝗨𝗥𝗖𝗘 𝙏𝙝𝙚𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n**⌔╎المستخدم -** {mention}\n**⌔╎البوت - {TBOT}**\n**⌔╎للمساعده - {DEVL}**\n**اكتب {T}بنك لتحقق اذا ما كان البوت يعمل**"
)

Tlk = " تم استرداد ⫸"
IS = "⫷ لايمكن تحميل - {} بسبب {} ⫸"

#- TOSH is the most beautiful girl in the world -#
ICSJ = "<ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ>"
StartLoaded = "<ⵧⵧⵧⵧⵧⵧ⫷ - THEO PLUGINS - ⫸ⵧⵧⵧⵧⵧⵧ>"
ASSISTANT = "<ⵧⵧⵧⵧⵧⵧ⫷ - THEO ASSISTANT - ⫸ⵧⵧⵧⵧⵧⵧ>"
KIMOTOSHA = "<ⵧⵧⵧⵧⵧⵧⵧⵧ⫷ - THEO TOSHA - ⫸ⵧⵧⵧⵧⵧⵧⵧ>"
ANIMATIONS = "<ⵧⵧⵧⵧⵧⵧ⫷ - THEO ANIMATIONS - ⫸ⵧⵧⵧⵧⵧ>"
ADMIN = "<ⵧⵧⵧⵧⵧ⫷ - THEO ADMIN TOOLS - ⫸ⵧⵧⵧⵧⵧ>"
ASSISTANTPM = "<ⵧⵧⵧⵧⵧ⫷ - THEO ASSISTANT PM - ⫸ⵧⵧⵧⵧⵧ>"
ICSW = "<ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ>"
# --- MESSI IS THE BEST PLAYER IN THE WORLD --- #

Plg = "userbot/plugins/*.py"
Adm = "userbot/plugins/Admin/*.py"
Inm = "userbot/plugins/animations/*.py"
Tsh = "userbot/plugins/tosha/*.py"
Ast = "userbot/plugins/assistant/*.py"
Pmt = "userbot/plugins/assistant/PmTosh/*.py"

Message = (
"""       ⫷ تم الانتهاء من التنصيب ⫸
⫷ بوت ثـيـو يعمل بنجاح الان ⫸
   ⫷ المستخدم: {} - البوت: {} ⫸
   ⫷ ارجع الى حسابك ودز الامر (.الاوامر) ⫸
⫷ @Source_Theo  - اذا كنت بحاجه الى مساعده فتوجه الى ⫸
⫷ @XIX_A - تحياتي : مرسليو  ⫸"""
)

Mesg = [
    '⫷ يتم تحميل انلاين ثـيـو ⫸',
    '⫷ اكتمل تنزيل انلاين ثـيـو بدون اخطاء ⫸',
    '⫷ يتم بدء بوت ثـيـو ⫸',
    '⫷ اكتمل بدء بوت ثـيـو ⫸'
]

Quotly = [
    '**⌔╎اهلا -** {} **قم برد على الرساله**',
    '**⌔╎اهلا -** {} **التنسيق غير مدعوم**',
    '**⌔╎جاري المعـالجه….**',
    '**⌔╎قم بالرد على الرساله او قم بوضع النص قرب الامر**',
    '**⌔╎اهلا -** {} **خطا في بناء الامر**',
    '**⌔╎يرجى الغاء الحظر من البوت ~** @quotlybot'
]

Cmds = "𓆰 [𝗦𝗢𝗨𝗥𝗖𝗘 𝙏𝙝𝙚𝙤 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺](t.me/Source_Theo ) 𓆪\n◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n**⌔╎اهلاً بك عزيزي اختر الاوامـر الاتيـه - ملاحظـه : ضع نقطه (.) بداية كل أمر :**\n `.م1`**   ➪ اوامـر الادمن** \n `.م2`**   ➪ اوامـر التسليه**\n `.م3`**   ➪ اوامـر الترحيب**\n `.م4`**   ➪ اوامـر الردود**\n `.م5`**   ➪ اوامـر الرفع**\n `.م6`**   ➪ اوامـر الحمايه**\n `.م7`**   ➪ اوامـر التلكراف**\n `.م8`**   ➪ اوامـر الملصقات**\n `.م9`**   ➪ اوامـر التاك**\n `.م10`** ➪ اوامـر الكشف**\n `.م11`** ➪ اوامـر المجموعه**\n `.م12`** ➪ اوامـر الترجمه**\n `.م13`** ➪ اوامـر البحث**\n `.م14`** ➪ اوامـر الانتحال**\n `.م15`** ➪ اوامـر النت**\n `.م16`** ➪ اوامـر البوت**\n `.م17`** ➪ اوامـر الحساب**\n `.م18`** ➪ اوامـر السورس**\n `.م19`** ➪ اوامـر الزغـرفه**\n `.م20`** ➪ اوامـر المتحركات**\n `.م21`** ➪ اوامـر الهمسه**\n `.م22`** ➪ اوامـر الالعاب**\n `.م23`** ➪ اوامـر الحاسبه**\n `.م24`** ➪ اوامـر هيروكو**\n `.م25`** ➪ اوامـر الوقتـي**\n `.م26`** ➪ اوامـر القائمة السوداء**\n `.م27`** ➪ اوامـر التحـويلات**\n `.م28`** ➪ اوامـر الكـشف العـام**\n `.م29`** ➪ اوامـر ذاتيـة الـتدمير**\n `.م30`** ➪ اوامـر الثيمـات**\n `.م31`** ➪ اوامـر خلفيات الشاشـه**\n `.م32`** ➪ اوامـر الافتـارات والستـوريات**\n `.م33`** ➪ اوامـر الاسـلاميـات**\n `.م34`** ➪ اوامـر الارقـام والبطـاقـات**\n ◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n 𓆩 [𝗦𝗢𝗨𝗥𝗖𝗘 𝙏𝙝𝙚𝙤 - قنـاة السـورس](t.me/Source_Theo ) 𓆪"

# Help String - Text when u type .help!
HelpString = "𓆩 𝗦𝗢𝗨𝗥𝗖𝗘 𝙏𝙝𝙚𝙤 - **قائمـة المساعـده** 𓆪\n◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n**⌔╎اهلا بك عزيزي {} في قائمه الانلاين:**\n\n**⪼ استخدم** `.مساعده واسم الاضافه`\n**لاضهار الاوامر بدون الاستخدام.**\n\n**⪼ استخدم** `.شرح واسم الاضافه`\n**لاضهار الاوامر وطريقه استخدامها وفوائدها**"

# For Dev:
Devt = "𓄂╺  𝑫𝑬𝑽 𝑼𝑺𝑬𝑹\n╰──► {} ༗".format(DEVL)

# For Echo - EchoText:
Echo = [
    '**⌔╎اهلا -** {}\n**⌔╎انه موجود بلفعل في قائمه الازعاج**',
    '**⌔╎هها هلو 🤍🎧 ،**',
    '**⌔╎اهلا -** {} \n**⌔╎قم برد على الرساله لكي تتم اضافته الى قائمه الازعاج**',
    '**⌔╎اهلا -** {} \n**⌔╎تم ايقاف امر الازعاج**',
    '**⌔╎اهلا -** {} \n**⌔╎هذا المستخدم غير مضاف الى قائمه الازعاج**',
    '𓆩 𝗦𝗢𝗨𝗥𝗖𝗘 𝙏𝙝𝙚𝙤 - 𝑬𝑪𝑯𝑶 𝑳𝑰𝑺𝑻 𓆪\n◐━─━─━─━─**𝙏𝙝𝙚𝙤**─━─━─━─━◐\n**⌔╎قائمة المضافين للازعاج:**\n',
    '**- ايدي المستخدم :** `{}`\n**- ايدي الـمجموعه :** `{}`\n\n',
    '**⌔╎اهلا - {} \n**⌔╎لم تقم باضافه احد للقائمه**'
]
